app/views/users/index.html.erb

    <ul>
      @users = User.all
---
SELECT "users".* FROM "users"