app/views/users/show.html.erb

    <ul>
      <% user.posts.each do |post| %>
---
SELECT "posts".* FROM "posts"