app/controllers/comments_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def new
    @user = User.find(params[:user_id])
    @post = Post.find(params[:post_id])

INSERT INTO "comments" ("text", "author_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["text", "hello"], ["author_id", 1], ["post_id", 3], ["created_at", "2023-06-24 10:29:05.204465"], ["updated_at", "2023-06-24 10:29:05.204465"]]
---
  def create
    @comment = Comment.new(text: comment_params[:text], post_id: params[:post_id], author_id: current_user[:id])

    if @comment.save