app/models/comment.rb

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 2]]
UPDATE "posts" SET "comments_counter" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["comments_counter", 1], ["updated_at", "2023-06-23 23:28:50.529379"], ["id", 2]]
---
    def update_post_comments_counter
      post.update(comments_counter: post.comments.count)