app/models/like.rb

    def update_likes_counter
      post.update(likes_counter: post.likes.count)
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 3]]
UPDATE "posts" SET "likes_counter" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["likes_counter", 1], ["updated_at", "2023-06-26 05:35:52.413053"], ["id", 3]]